artillery.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 100
      arrivalRate: 10
  http:
    extendedMetrics: true
scenarios:
  - flow:
      - post:
          url: '/login'
          json:
            login: 'admin'
            password: 'admin'
          capture:
            json: $.token
            as: token

      - post:
          url: '/users'
          json:
            name: 'test'
            login: 'testlogin'
            password: 'testpassword'
          headers:
            Authorization: 'Bearer {{ token }}'
          capture:
            json: $.id
            as: id
      - get:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users'
      - get:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users/{{id}}'
      - put:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users/{{id}}'
          json:
            id: '{{ id }}'
            name: 'test'
            login: 'testNewLogin'
            password: 'testpassword'
      - delete:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users/{{id}}'